# PhyMaterialParamThermalConductivity Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PhyMaterialParamThermalConductivity Property
ParameterTypeId Class See Also
---
"Thermal Conductivity"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PhyMaterialParamThermalConductivity { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PhyMaterialParamThermalConductivity As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PhyMaterialParamThermalConductivity {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace